<a href="https://colab.research.google.com/github/Mgobeaalcoba/Full_Pandas/blob/main/2_dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
pd.__version__

'1.3.4'

In [ ]:
!pip install --upgrade pandas # Actualizo pandas a su ultima version

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.1.5)
Collecting pandas
  Downloading pandas-1.3.4-cp37-cp37m-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (11.3 MB)
     |████████████████████████████████| 11.3 MB 5.3 MB/s
Requirement already satisfied: pytz>=2017.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.17.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Installing collected packages: pandas
  Attempting uninstall: pandas
    Found existing installation: pandas 1.1.5
    Uninstalling pandas-1.1.5:
      Successfully uninstalled pandas-1.1.5
ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
google-colab 1.0.0 requires pandas~=1.1.0; python_version >= "3.0", but you have pandas 1.3.4 which is incompatible.
Successfully installed pandas-1.3.4

In [ ]:
dict_data = {"CO":300,"MX":400,"CM":200}
dict_data

{'CM': 200, 'CO': 300, 'MX': 400}

In [ ]:
pd.Series(dict_data)

CO    300
MX    400
CM    200
dtype: int64

In [ ]:
dict_data = {"CH": [100,800,200],"CO": [100,200,300],"MX": [300,500,400]}
dict_data

{'CH': [100, 800, 200], 'CO': [100, 200, 300], 'MX': [300, 500, 400]}

In [ ]:
pd.DataFrame(dict_data) # Las llaves de mi diccionario serán las columnas del dataframe

    CH   CO   MX
0  100  100  300
1  800  200  500
2  200  300  400

In [ ]:
pd.Series(dict_data) # En la seríe las llaves son los indices de cada fila

CH    [100, 800, 200]
CO    [100, 200, 300]
MX    [300, 500, 400]
dtype: object

In [ ]:
dict_data = {
    "edad" : [10,9,13,14,12,11,12],
    "cm" : [115,110,130,155,125,120,125],
    "pais" : ["co","mx","co","mx","mx","ch","ch"],
    "genero" : ["M","F","F","M","M","M","F"],
    "01" : [5,10,8,np.nan,7,8,3],
    "02" : [7,9,9,8,8,8,9]
}
dict_data

{'01': [5, 10, 8, nan, 7, 8, 3],
 '02': [7, 9, 9, 8, 8, 8, 9],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'edad': [10, 9, 13, 14, 12, 11, 12],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch']}

In [ ]:
pd.Series(dict_data)

edad              [10, 9, 13, 14, 12, 11, 12]
cm        [115, 110, 130, 155, 125, 120, 125]
pais             [co, mx, co, mx, mx, ch, ch]
genero                  [M, F, F, M, M, M, F]
01                   [5, 10, 8, nan, 7, 8, 3]
02                      [7, 9, 9, 8, 8, 8, 9]
dtype: object

In [ ]:
df = pd.DataFrame(dict_data,index=["Ana","Benito","Camilo","Daniel","Erika","Fabian","Daniel"]) # Puedo no detallar el index y va de 0 a el ultimo
df

        edad   cm pais genero    01  02
Ana       10  115   co      M   5.0   7
Benito     9  110   mx      F  10.0   9
Camilo    13  130   co      F   8.0   9
Daniel    14  155   mx      M   NaN   8
Erika     12  125   mx      M   7.0   8
Fabian    11  120   ch      M   8.0   8
Daniel    12  125   ch      F   3.0   9

In [ ]:
df.index # Me muestra los nombres de cada Fila

Index(['Ana', 'Benito', 'Camilo', 'Daniel', 'Erika', 'Fabian', 'Daniel'], dtype='object')

In [ ]:
df.columns # Me muestra los nombres de cada columna

Index(['edad', 'cm', 'pais', 'genero', '01', '02'], dtype='object')

In [ ]:
df.values # Me muestra EN FORMATO ARRAYS los valores contenidos en cada fila

array([[10, 115, 'co', 'M', 5.0, 7],
       [9, 110, 'mx', 'F', 10.0, 9],
       [13, 130, 'co', 'F', 8.0, 9],
       [14, 155, 'mx', 'M', nan, 8],
       [12, 125, 'mx', 'M', 7.0, 8],
       [11, 120, 'ch', 'M', 8.0, 8],
       [12, 125, 'ch', 'F', 3.0, 9]], dtype=object)

In [ ]:
df["edad"] # Veo una serie de pandas con los datos de la edad exclusivamente

Ana       10
Benito     9
Camilo    13
Daniel    14
Erika     12
Fabian    11
Daniel    12
Name: edad, dtype: int64

In [ ]:
df[["edad","pais"]] # Veo un dataframe mas pequeño con las columnas escogidas

        edad pais
Ana       10   co
Benito     9   mx
Camilo    13   co
Daniel    14   mx
Erika     12   mx
Fabian    11   ch
Daniel    12   ch

In [ ]:
df.loc[["Ana","Benito"],["edad","pais"]] # El metodo .loc es para buscar una fila o varias especificas y luego las columnas que deseo. Nos arroja una serie si buscamos solo una fila y un dataframe si buscamos dos o mas

        edad pais
Ana       10   co
Benito     9   mx

In [ ]:
df.iloc[2,1] # Nos permite identificar elementos por su posición en la matriz. Primero filas y luego columnas

130

In [ ]:
df.iloc[[2,4],[1,3]]

         cm genero
Camilo  130      F
Erika   125      M

In [ ]:
df.iloc[:,[1,3]] # Con los dos puntos le indico que quiero todos. En este caso las filas. Pero podría ser tmb columnas

         cm genero
Ana     115      M
Benito  110      F
Camilo  130      F
Daniel  155      M
Erika   125      M
Fabian  120      M
Daniel  125      F

In [ ]:
df["edad"] >= 12 # Me indica cuales cumplen un requisito si quiero traer esa info coloco este condicional de pandas dentro de mi corchete

Ana       False
Benito    False
Camilo     True
Daniel     True
Erika      True
Fabian    False
Daniel     True
Name: edad, dtype: bool

In [ ]:
df[df["edad"] >= 12]

        edad   cm pais genero   01  02
Camilo    13  130   co      F  8.0   9
Daniel    14  155   mx      M  NaN   8
Erika     12  125   mx      M  7.0   8
Daniel    12  125   ch      F  3.0   9

**Si quiero filtrar mas de una condición entonces las debo poner entre parentesis a cada una. **

In [ ]:
df[(df["edad"] >= 12) & (df["pais"] == "mx")] # Con el operador & puedo sumar argumentos al filtro

        edad   cm pais genero   01  02
Daniel    14  155   mx      M  NaN   8
Erika     12  125   mx      M  7.0   8

**Tmb se puede obtener el mismo resultado con la función query**

In [ ]:
df.query("edad >= 12")

        edad   cm pais genero   01  02
Camilo    13  130   co      F  8.0   9
Daniel    14  155   mx      M  NaN   8
Erika     12  125   mx      M  7.0   8
Daniel    12  125   ch      F  3.0   9

In [ ]:
df["02"] >= df["01"]

Ana        True
Benito    False
Camilo     True
Daniel    False
Erika      True
Fabian     True
Daniel     True
dtype: bool

In [ ]:
df[df["02"] >= df["01"]]

        edad   cm pais genero   01  02
Ana       10  115   co      M  5.0   7
Camilo    13  130   co      F  8.0   9
Erika     12  125   mx      M  7.0   8
Fabian    11  120   ch      M  8.0   8
Daniel    12  125   ch      F  3.0   9